; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v6 - type_1 ?v4 - type_3)
 	      (pred_1 ?v2 - object ?v4 - type_3)
	      (pred_3 ?v6 - type_1 ?v7 - type_2)
	      (pred_2 ?v6 - type_1 ?v2 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v3 ?v5 - type_3)
       :precondition (and  (pred_4 ?v6 ?v3))
       :effect (and  (pred_4 ?v6 ?v5)
		     (not (pred_4 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_1 ?v1 - object ?v8 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v8) (pred_4 ?v6 ?v8) (pred_3 ?v6 ?v7))
       :effect (and (pred_2 ?v6 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_3 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v1 - object ?v8 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v1 ?v7) (pred_4 ?v6 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_3 ?v6 ?v7)
		    (not (pred_2 ?v6 ?v1 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_06 - type_1
obj_08 obj_09 obj_04 obj_05 - type_2
obj_02 obj_12 obj_03 - type_3
obj_01 obj_10 obj_07 - object)
(:init
(pred_4 obj_11 obj_02)
(pred_3 obj_11 obj_08)
(pred_3 obj_11 obj_09)
(pred_4 obj_06 obj_02)
(pred_3 obj_06 obj_04)
(pred_3 obj_06 obj_05)
(pred_1 obj_01 obj_12)
(pred_1 obj_10 obj_03)
(pred_1 obj_07 obj_02)
)
(:goal
(and
(pred_1 obj_01 obj_02)
(pred_1 obj_10 obj_12)
(pred_1 obj_07 obj_03)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_03)))
)
)

; plan
1. (op_3 obj_11 obj_07 obj_02 obj_09)
   deleted: (pred_1 obj_07 obj_02) (pred_3 obj_11 obj_09)
   added: (pred_2 obj_11 obj_07 obj_09)
   goals met: 0 of 3
2. (op_1 obj_06 obj_02 obj_12)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_12)
   goals met: 0 of 3
3. (op_3 obj_06 obj_01 obj_12 obj_05)
   deleted: (pred_1 obj_01 obj_12) (pred_3 obj_06 obj_05)
   added: (pred_2 obj_06 obj_01 obj_05)
   goals met: 0 of 3
4. (op_1 obj_11 obj_02 obj_12)
   deleted: (pred_4 obj_11 obj_02)
   added: (pred_4 obj_11 obj_12)
   goals met: 0 of 3
5. (op_1 obj_06 obj_12 obj_02)
   deleted: (pred_4 obj_06 obj_12)
   added: (pred_4 obj_06 obj_02)
   goals met: 0 of 3
6. (op_2 obj_11 obj_07 obj_12 obj_09)
   deleted: (pred_2 obj_11 obj_07 obj_09)
   added: (pred_1 obj_07 obj_12) (pred_3 obj_11 obj_09)
   goals met: 0 of 3
7. (op_2 obj_06 obj_01 obj_02 obj_05)
   deleted: (pred_2 obj_06 obj_01 obj_05)
   added: (pred_1 obj_01 obj_02) (pred_3 obj_06 obj_05)
   goals met: 1 of 3
8. (op_1 obj_06 obj_02 obj_03)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_03)
   goals met: 1 of 3
9. (op_3 obj_06 obj_10 obj_03 obj_05)
   deleted: (pred_1 obj_10 obj_03) (pred_3 obj_06 obj_05)
   added: (pred_2 obj_06 obj_10 obj_05)
   goals met: 1 of 3
10. (op_1 obj_06 obj_03 obj_12)
   deleted: (pred_4 obj_06 obj_03)
   added: (pred_4 obj_06 obj_12)
   goals met: 1 of 3
11. (op_2 obj_06 obj_10 obj_12 obj_05)
   deleted: (pred_2 obj_06 obj_10 obj_05)
   added: (pred_1 obj_10 obj_12) (pred_3 obj_06 obj_05)
   goals met: 2 of 3
12. (op_3 obj_06 obj_07 obj_12 obj_05)
   deleted: (pred_1 obj_07 obj_12) (pred_3 obj_06 obj_05)
   added: (pred_2 obj_06 obj_07 obj_05)
   goals met: 2 of 3
13. (op_1 obj_06 obj_12 obj_03)
   deleted: (pred_4 obj_06 obj_12)
   added: (pred_4 obj_06 obj_03)
   goals met: 2 of 3
14. (op_2 obj_06 obj_07 obj_03 obj_05)
   deleted: (pred_2 obj_06 obj_07 obj_05)
   added: (pred_1 obj_07 obj_03) (pred_3 obj_06 obj_05)
   goals met: 3 of 3
